---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.#ctor(System.Double,System.Double)
source: html/546a897a-f5ba-4afd-20d1-3a0039af2598.htm
---
# Autodesk.Revit.DB.FillGrid.#ctor Method

Creates a simple fill grid with given angle and offset.

## Syntax (C#)
```csharp
public FillGrid(
	double angle,
	double offset
)
```

## Parameters
- **angle** (`System.Double`) - The angle.
- **offset** (`System.Double`) - The offset represents the spacing between the lines.